def formalize(answer, context):
    prompt_text = (
        "Извлеки отдельно из системы переписывания термов термы и отдельно интерпретации конструкторов из запроса {} "
        "Переменные в термах и в интерпретациях конструкторов: любая латинская буква. Никаких пояснений и дополнительной информации не нужно."
    ).format(answer)

    if context != "":
        prompt_text += (" При извлечении термов и интерпретаций из запроса учти: " + context)

    return prompt_text


answer = """Дана система переписывания термов:
g(x, h(y)) = f(g(x, y), x)
g(x, z) = z
Я интерпретирую её конструкторы функциями:
h(y) = y+1
f(x, y)=x+2*y
g(x,y)=(x+y){2}
Доказывает ли моя интерпретация завершаемость TRS?"""
context = ""
print(formalize(answer, context))
